{
  "bypass": [
    ".bat",
    ".cs",
    ".env",
    ".htaccess",
    ".js",
    ".net",
    ".svn",
    ".ui-widget-content",
    "/tmp",
    "1.0",
    "1.2",
    "1.7",
    "1.9",
    "10.10",
    "10.6",
    "2.0",
    "2.5",
    "2.7",
    "2.7.4",
    "3)",
    "3.6",
    "4.4",
    "5.5",
    "500",
    "7.1",
    "8.1",
    "<link>",
    "activity",
    "add()",
    "ajax",
    "alert box",
    "anaconda",
    "android",
    "android studio",
    "angular",
    "angularjs",
    "apache",
    "apk",
    "apple",
    "array",
    "arraylist",
    "arraylists",
    "arrays",
    "arrow",
    "as3",
    "asp.net",
    "asp.net mvc",
    "async",
    "asynctask",
    "babel",
    "backbone",
    "base64",
    "bash",
    "bean",
    "beans",
    "bin",
    "boolean",
    "bootstrap",
    "border",
    "borderlayout",
    "borders",
    "browser",
    "browsers",
    "buffer",
    "buffers",
    "build.gradle",
    "button",
    "buttons",
    "bytes",
    "c#",
    "c++",
    "cakephp",
    "cell",
    "cells",
    "centos",
    "char",
    "chars",
    "checkbox",
    "checkboxes",
    "chrome",
    "ckeditor",
    "client",
    "client-side",
    "cmd",
    "codeigniter",
    "codepen",
    "column",
    "columns",
    "combobox",
    "command line",
    "compiler",
    "composer",
    "computer",
    "console",
    "context menu",
    "cpu",
    "cron",
    "cronjob",
    "css",
    "csv",
    "curl",
    "cygwin",
    "dashboard",
    "data.frame",
    "datacontext",
    "dataframe",
    "datagrid",
    "datagridview",
    "datatable",
    "datatables",
    "datepicker",
    "datetime",
    "datetimes",
    "dbcontext",
    "dealloc",
    "debugger",
    "desktop",
    "dialog",
    "dialogs",
    "disk",
    "div",
    "divs",
    "django",
    "dll",
    "dom",
    "domdocument",
    "doubles",
    "dragleave",
    "driver",
    "drop down menu",
    "dropdown",
    "eclipse",
    "ef",
    "es2015",
    "es6",
    "eval",
    "eval()",
    "excel",
    "exception",
    "exceptions",
    "ext.js",
    "facebook",
    "ff",
    "ffmpeg",
    "fiddle",
    "firebug",
    "firefox",
    "firewall",
    "flash",
    "float",
    "footer",
    "gem",
    "gif",
    "git",
    "github",
    "global",
    "gnu",
    "google",
    "google app engine",
    "google chrome",
    "google drive",
    "gradle",
    "graph",
    "grid",
    "gridview",
    "groovy",
    "gson",
    "gwt",
    "hashmap",
    "haskell",
    "href",
    "html",
    "html5",
    "httpclient",
    "icon",
    "ie",
    "ie8",
    "iframe",
    "image",
    "images",
    "index.php",
    "innerhtml",
    "installer",
    "int",
    "integer",
    "integers",
    "intellij",
    "intent",
    "ints",
    "ios",
    "ipad",
    "iphone",
    "itemssource",
    "itemtemplate",
    "jar",
    "java",
    "javascript",
    "jframe",
    "jpanel",
    "jpg",
    "jquery",
    "jquery ui",
    "js",
    "jsbin",
    "jsfiddle",
    "json",
    "jsp",
    "jvm",
    "kernel",
    "keyboard",
    "labels",
    "lambda",
    "laravel",
    "lazy loading",
    "lib",
    "linked list",
    "linq",
    "linux",
    "lion",
    "list",
    "listbox",
    "listboxitem",
    "lists",
    "listview",
    "log4j",
    "logcat",
    "logger",
    "mac",
    "mac os",
    "macos",
    "magento",
    "main()",
    "main.cpp",
    "main.py",
    "mainactivity",
    "mainactivity.java",
    "markdown",
    "matlab",
    "matrix",
    "maven",
    "menu",
    "message box",
    "mobile",
    "mod_rewrite",
    "models.py",
    "mongodb",
    "mouse",
    "mozilla firefox",
    "msbuild",
    "mutable",
    "mvc",
    "mvvm",
    "mysql",
    "ng-repeat",
    "nhibernate",
    "nib",
    "node.js",
    "node_modules",
    "nodejs",
    "nodes",
    "notepad",
    "nsarray",
    "nsobject",
    "nsstring",
    "oauth",
    "objective-c",
    "onclick",
    "oncreate",
    "opencv",
    "opera",
    "oracle",
    "os x",
    "osx",
    "pandas",
    "pane",
    "panel",
    "panels",
    "pc",
    "pdf",
    "perl",
    "photos",
    "php",
    "pi",
    "pictures",
    "pin",
    "plots",
    "plunker",
    "png",
    "pointer",
    "pointers",
    "pom.xml",
    "pop-up",
    "port",
    "postgresql",
    "postman",
    "powershell",
    "printer",
    "processor",
    "profiles",
    "push()",
    "pyspark",
    "python",
    "qt",
    "queue",
    "queues",
    "rails",
    "ram",
    "rectangles",
    "recyclerview",
    "redis",
    "redshift",
    "relativelayout",
    "rest api",
    "rich text",
    "router",
    "row",
    "rows",
    "ruby",
    "safari",
    "screens",
    "scroll bar",
    "scrollbar",
    "selecteditem",
    "selenium",
    "server",
    "server-side",
    "servers",
    "servlet",
    "settimeout()",
    "settings.py",
    "sharepoint",
    "sheets",
    "shell",
    "size_t",
    "slider",
    "spark",
    "spreadsheet",
    "spring",
    "spring boot",
    "sql",
    "sql server",
    "sqlfiddle",
    "sqlite",
    "sqlite3",
    "sqlserver",
    "stack overflow",
    "stackoverflow",
    "static",
    "storyboard",
    "string",
    "strings",
    "struct",
    "sublime",
    "subversion",
    "super()",
    "svg",
    "svn",
    "swift",
    "swt",
    "symfony",
    "tab",
    "table",
    "tables",
    "tabs",
    "td",
    "terminal",
    "testng",
    "text editor",
    "textbox",
    "textboxes",
    "texture",
    "textview",
    "textviews",
    "timestamp",
    "toolbar",
    "tortoisesvn",
    "tostring()",
    "tr",
    "tree",
    "tuple",
    "twig",
    "txt",
    "ubuntu",
    "uinavigationcontroller",
    "uitableview",
    "ul",
    "unity",
    "unix",
    "var",
    "vb.net",
    "vba",
    "vector",
    "vectors",
    "video",
    "view controller",
    "viewdidload",
    "viewer",
    "viewmodel",
    "virtual machine",
    "visual studio",
    "vm",
    "vs2008",
    "vs2010",
    "w3c",
    "wcf",
    "web.xml",
    "webpack",
    "webview",
    "widget",
    "widgets",
    "win",
    "win7",
    "window",
    "windows",
    "windows service",
    "wizard",
    "wordpress",
    "wpf",
    "xamarin",
    "xamarin.ios",
    "xaml",
    "xcode",
    "xml",
    "xp",
    "xpath",
    "xsd",
    "youtube",
    "~ /.bash_profile"
  ],
  "seeds": [
    ".bat",
    ".cs",
    ".env",
    ".htaccess",
    ".js",
    ".net",
    ".svn",
    ".ui-widget-content",
    "/tmp",
    "1.0",
    "1.2",
    "1.7",
    "1.9",
    "10.10",
    "10.6",
    "2.0",
    "2.5",
    "2.7",
    "2.7.4",
    "3)",
    "3.6",
    "4.4",
    "5.5",
    "500",
    "7.1",
    "8.1",
    "<link>",
    "activity",
    "add()",
    "ajax",
    "alert box",
    "anaconda",
    "android",
    "android studio",
    "angular",
    "angularjs",
    "apache",
    "apk",
    "apple",
    "array",
    "arraylist",
    "arraylists",
    "arrays",
    "arrow",
    "as3",
    "asp.net",
    "asp.net mvc",
    "assembly",
    "async",
    "asynctask",
    "babel",
    "backbone",
    "base64",
    "bash",
    "battery",
    "bean",
    "beans",
    "bin",
    "boolean",
    "bootstrap",
    "border",
    "borderlayout",
    "borders",
    "browser",
    "browsers",
    "buffer",
    "buffers",
    "build.gradle",
    "button",
    "buttons",
    "bytes",
    "c#",
    "c++",
    "cakephp",
    "cell",
    "cells",
    "centos",
    "char",
    "chars",
    "chart",
    "checkbox",
    "checkboxes",
    "chrome",
    "ckeditor",
    "client",
    "client-side",
    "clients",
    "cmd",
    "codeigniter",
    "codepen",
    "column",
    "columns",
    "combobox",
    "command line",
    "compiler",
    "composer",
    "computer",
    "console",
    "context menu",
    "cpu",
    "cron",
    "cronjob",
    "css",
    "csv",
    "curl",
    "cygwin",
    "dashboard",
    "data.frame",
    "datacontext",
    "dataframe",
    "datagrid",
    "datagridview",
    "datatable",
    "datatables",
    "datepicker",
    "datetime",
    "datetimes",
    "dbcontext",
    "dealloc",
    "debugger",
    "decimal",
    "desktop",
    "dialog",
    "dialogs",
    "disk",
    "div",
    "divs",
    "django",
    "dll",
    "dom",
    "domdocument",
    "doubles",
    "dragleave",
    "driver",
    "dropdown",
    "eclipse",
    "ef",
    "enum",
    "es2015",
    "es6",
    "eval",
    "eval()",
    "excel",
    "exception",
    "exceptions",
    "ext.js",
    "facebook",
    "ff",
    "ffmpeg",
    "fiddle",
    "firebug",
    "firefox",
    "firewall",
    "flash",
    "float",
    "foo",
    "footer",
    "gem",
    "gif",
    "git",
    "github",
    "global",
    "gnu",
    "google",
    "google chrome",
    "google drive",
    "gradle",
    "graph",
    "grid",
    "gridview",
    "groovy",
    "gson",
    "gwt",
    "hashmap",
    "haskell",
    "href",
    "htaccess",
    "html",
    "html5",
    "httpclient",
    "icon",
    "ie",
    "ie8",
    "iframe",
    "image",
    "images",
    "index.html",
    "index.php",
    "innerhtml",
    "installer",
    "int",
    "integer",
    "integers",
    "intellij",
    "intent",
    "ints",
    "ios",
    "ipad",
    "iphone",
    "itemssource",
    "itemtemplate",
    "jar",
    "java",
    "javascript",
    "jframe",
    "jpanel",
    "jpg",
    "jquery",
    "jquery ui",
    "js",
    "jsbin",
    "jsfiddle",
    "json",
    "jsp",
    "jvm",
    "kernel",
    "keyboard",
    "labels",
    "lambda",
    "laravel",
    "lazy loading",
    "lib",
    "linked list",
    "linq",
    "linux",
    "lion",
    "list",
    "listbox",
    "listboxitem",
    "lists",
    "listview",
    "log4j",
    "logcat",
    "logger",
    "mac",
    "mac os",
    "macos",
    "magento",
    "main()",
    "main.cpp",
    "main.py",
    "mainactivity",
    "mainactivity.java",
    "markdown",
    "matlab",
    "matrix",
    "maven",
    "menu",
    "message box",
    "microsoft",
    "mobile",
    "mod_rewrite",
    "models.py",
    "mongodb",
    "mouse",
    "mozilla firefox",
    "msbuild",
    "mutable",
    "mvc",
    "mvvm",
    "mysql",
    "ng-repeat",
    "nhibernate",
    "nib",
    "node.js",
    "node_modules",
    "nodejs",
    "nodes",
    "notepad",
    "notification",
    "nsarray",
    "nsobject",
    "nsstring",
    "oauth",
    "objective-c",
    "onclick",
    "oncreate",
    "opencv",
    "opera",
    "oracle",
    "os x",
    "osx",
    "pandas",
    "pane",
    "panel",
    "panels",
    "pc",
    "pdf",
    "perl",
    "photos",
    "php",
    "pi",
    "picture",
    "pictures",
    "pin",
    "plots",
    "plunker",
    "png",
    "pointer",
    "pointers",
    "pom.xml",
    "pop-up",
    "port",
    "postgresql",
    "postman",
    "powershell",
    "printer",
    "processor",
    "profiles",
    "push()",
    "pyspark",
    "python",
    "qt",
    "queue",
    "queues",
    "rails",
    "ram",
    "rectangles",
    "recyclerview",
    "redis",
    "redshift",
    "relativelayout",
    "rest api",
    "rich text",
    "route",
    "router",
    "row",
    "rows",
    "ruby",
    "safari",
    "screens",
    "scroll bar",
    "scrollbar",
    "sdk",
    "selecteditem",
    "selenium",
    "server",
    "server-side",
    "servers",
    "servlet",
    "settimeout()",
    "settings.py",
    "sharepoint",
    "sheet",
    "sheets",
    "shell",
    "size_t",
    "slider",
    "spark",
    "spreadsheet",
    "spring",
    "spring boot",
    "sql",
    "sql server",
    "sqlfiddle",
    "sqlite",
    "sqlite3",
    "sqlserver",
    "stack overflow",
    "stackoverflow",
    "static",
    "storyboard",
    "string",
    "strings",
    "struct",
    "sublime",
    "subversion",
    "super()",
    "svg",
    "svn",
    "swift",
    "swt",
    "symfony",
    "tab",
    "table",
    "tables",
    "tableview",
    "tabs",
    "td",
    "terminal",
    "testng",
    "text editor",
    "textbox",
    "textboxes",
    "texture",
    "textview",
    "textviews",
    "timestamp",
    "tomcat",
    "toolbar",
    "tortoisesvn",
    "tostring()",
    "tr",
    "tree",
    "tuple",
    "twig",
    "txt",
    "ubuntu",
    "uinavigationcontroller",
    "uitableview",
    "ul",
    "unity",
    "unix",
    "var",
    "varchar",
    "vb.net",
    "vba",
    "vector",
    "vectors",
    "video",
    "videos",
    "view controller",
    "viewdidload",
    "viewer",
    "viewmodel",
    "virtual machine",
    "visual studio",
    "vm",
    "vs2008",
    "vs2010",
    "w3c",
    "wcf",
    "web.xml",
    "webpack",
    "webview",
    "widget",
    "widgets",
    "win",
    "win7",
    "window",
    "windows",
    "windows service",
    "wizard",
    "wordpress",
    "wpf",
    "xamarin",
    "xamarin.ios",
    "xaml",
    "xcode",
    "xml",
    "xp",
    "xpath",
    "xsd",
    "youtube",
    "~ /.bash_profile"
  ],
  "negatives": [
    "action",
    "all",
    "always",
    "and",
    "answer",
    "any",
    "are",
    "around",
    "as",
    "ascii",
    "at",
    "bad",
    "both",
    "btw",
    "but",
    "callback",
    "channel",
    "child",
    "class",
    "classpath",
    "code",
    "command",
    "constant",
    "consumer",
    "context",
    "database",
    "db",
    "debug",
    "demo",
    "distribution",
    "dns",
    "do",
    "dsl",
    "edit",
    "element",
    "en",
    "engine",
    "error",
    "extension",
    "factory",
    "field",
    "file",
    "filesystem",
    "forget",
    "framework",
    "function",
    "fyi",
    "gain",
    "gallery",
    "gb",
    "get",
    "green",
    "handle",
    "here",
    "http",
    "https",
    "idea",
    "if",
    "index",
    "info",
    "inner",
    "instance",
    "interface",
    "ip",
    "is",
    "it",
    "iterator",
    "just",
    "left",
    "level",
    "library",
    "listen",
    "listener",
    "may",
    "media",
    "meta",
    "method",
    "min",
    "model",
    "module",
    "most",
    "msvc",
    "my",
    "name",
    "namespace",
    "net",
    "never",
    "new",
    "no",
    "not",
    "note",
    "null",
    "object",
    "off",
    "ok",
    "on",
    "oo",
    "oop",
    "option",
    "or",
    "os",
    "other",
    "output",
    "package",
    "parent",
    "path",
    "pipe",
    "please",
    "print",
    "pro",
    "promise",
    "property",
    "protocol",
    "provider",
    "proxy",
    "ps",
    "re",
    "remove",
    "repository",
    "response",
    "runtime",
    "se",
    "seed",
    "selector",
    "short",
    "siblings",
    "smtp",
    "so",
    "soap",
    "socket",
    "specificity",
    "ssh",
    "ssl",
    "state",
    "sum",
    "tag",
    "target",
    "tcp",
    "thanks",
    "thumb",
    "tls",
    "top",
    "trace",
    "type",
    "ui",
    "up",
    "update",
    "url",
    "us",
    "user",
    "value",
    "variable",
    "variables",
    "web",
    "when",
    "will",
    "within",
    "wrap",
    "wrapper",
    "ws",
    "yes",
    "zsl"
  ],
  "contextual_seeds": [
    "api",
    "background",
    "binary",
    "character",
    "characters",
    "collection",
    "container",
    "double",
    "event",
    "form",
    "header",
    "height",
    "id",
    "log",
    "map",
    "node",
    "page",
    "phone",
    "plot",
    "plugin",
    "popup",
    "screen",
    "stack",
    "width",
    "word"
  ],
  "low_precision": [
    "accept",
    "access",
    "active",
    "add",
    "address",
    "another",
    "apply",
    "back",
    "book",
    "box",
    "cache",
    "call",
    "cancel",
    "case",
    "change",
    "close",
    "command",
    "component",
    "control",
    "controller",
    "copy",
    "count",
    "data",
    "date",
    "delete",
    "display",
    "doc",
    "document",
    "drive",
    "edge",
    "editor",
    "email",
    "entry",
    "error",
    "execute",
    "fetch",
    "field",
    "fields",
    "figure",
    "file",
    "final",
    "fit",
    "flag",
    "font",
    "forms",
    "frame",
    "free",
    "get",
    "getting",
    "graphics",
    "gui",
    "handler",
    "head",
    "hidden",
    "idea",
    "ids",
    "include",
    "indexes",
    "input",
    "item",
    "job",
    "join",
    "key",
    "layout",
    "let",
    "link",
    "live",
    "load",
    "local",
    "location",
    "login",
    "long",
    "main",
    "max",
    "methods",
    "model",
    "name",
    "network",
    "number",
    "objects",
    "open",
    "point",
    "points",
    "pop",
    "post",
    "printing",
    "problem",
    "profile",
    "queries",
    "query",
    "read",
    "refresh",
    "regex",
    "remove",
    "request",
    "requests",
    "resources",
    "response",
    "rest",
    "root",
    "scope",
    "script",
    "section",
    "series",
    "service",
    "session",
    "set",
    "show",
    "size",
    "snippet",
    "sort",
    "src",
    "start",
    "stream",
    "style",
    "tag",
    "task",
    "template",
    "thread",
    "threads",
    "title",
    "tools",
    "top",
    "update",
    "user",
    "validate",
    "value",
    "view",
    "write"
  ],
  "stats": {
    "total_train_docs": 741,
    "unique_entity_terms": 3276,
    "bypass_count": 428,
    "seeds_count": 445,
    "negatives_count": 162,
    "contextual_seeds_count": 25,
    "low_precision_count": 129
  }
}